//=============================================================================
//
// プレイヤー処理 [player.h]
// Author : 小川 朔哉
//
//=============================================================================
#pragma once
#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
bool CollisionRay(D3DXVECTOR3 pos, D3DXVECTOR3 pos2, LPD3DXMESH pMesh);
bool CollisionRectangle(D3DXVECTOR3 pos, D3DXVECTOR3 pos2);