//=============================================================================
//
// フェード処理 [fade.h]
// Author : 小川 朔哉
//
//=============================================================================
#pragma once
#include "main.h"

//*****************************************************************************
// 構造体
//*****************************************************************************
typedef enum
{
	FADE_NONE = 0,
	FADE_IN,
	FADE_OUT,
	FADE_MAX,
}FADE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitFade(void);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);
void SetFade(MODE mode);
FADE GetFade(void);
void MakeVertexFade(LPDIRECT3DDEVICE9 pDevice);